In [1]:
import numpy as np
import pandas as pd
import math

In [2]:
dict ={"Name":["Ram","Raj","Shyam","Guru"],
      "Marks":[89,69,35,78],
       "City":["Gurgaon","Hyderabad","Bangalore","Pune"]}

In [3]:
df=pd.DataFrame(dict) # making dataframe from dict

In [4]:
print(df)

    Name  Marks       City
0    Ram     89    Gurgaon
1    Raj     69  Hyderabad
2  Shyam     35  Bangalore
3   Guru     78       Pune

In [5]:
df.to_csv("Marks.csv")  # converting dataframe to csv file

In [6]:
df.to_csv("Marks_No_Index.csv",index=False)  # without index

In [7]:
df.head(2) # first 2 rows

  Name  Marks       City
0  Ram     89    Gurgaon
1  Raj     69  Hyderabad

In [8]:
df.tail(2)  # last 2 rows

    Name  Marks       City
2  Shyam     35  Bangalore
3   Guru     78       Pune

In [9]:
df.describe() # gives statistical details of the data

           Marks
count   4.000000
mean   67.750000
std    23.314874
min    35.000000
25%    60.500000
50%    73.500000
75%    80.750000
max    89.000000

In [10]:
df.shape  # gives no of rows, columns

(4, 3)

In [11]:
df.info()  # info about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [12]:
train=pd.read_csv("train.csv")
print(train)

       Train  Number       City
0    Doronto   12365    Gurgaon
1  Shatabdhi   13654  Hyderabad
2   Rajdhani   14563  Bangalore
3     Sabari   12369       Pune

In [13]:
# def ls(n):
#     i=1
#     for i in range(n):
#         yield i+1
# train.index=ls(len(train))

# train.index=[1,2,3,4]
train

       Train  Number       City
0    Doronto   12365    Gurgaon
1  Shatabdhi   13654  Hyderabad
2   Rajdhani   14563  Bangalore
3     Sabari   12369       Pune

In [14]:
ser=pd.Series((np.random.rand(10))*10)
ser

0    7.497520
1    3.028595
2    2.811575
3    5.191579
4    3.580675
5    6.188250
6    8.360739
7    4.491791
8    8.155888
9    6.392747
dtype: float64

In [15]:
type(ser)

pandas.core.series.Series

In [16]:
newdf=pd.DataFrame(np.random.rand(100,5),index=np.arange(100))
newdf

           0         1         2         3         4
0   0.543231  0.728122  0.397942  0.848026  0.530183
1   0.914631  0.022029  0.205045  0.646108  0.775886
2   0.769600  0.806182  0.044709  0.171805  0.567509
3   0.161033  0.561843  0.646805  0.176195  0.919086
4   0.212928  0.663454  0.750764  0.415041  0.254342
..       ...       ...       ...       ...       ...
95  0.352770  0.635185  0.563854  0.660197  0.762646
96  0.928164  0.403034  0.516458  0.479955  0.777993
97  0.626002  0.438932  0.643624  0.852553  0.043466
98  0.564175  0.653960  0.471058  0.073044  0.505609
99  0.135617  0.113859  0.166696  0.629501  0.888684

[100 rows x 5 columns]

In [17]:
type(newdf)
newdf.describe()  # returns statistical details

                0           1           2           3           4
count  100.000000  100.000000  100.000000  100.000000  100.000000
mean     0.533908    0.545896    0.521096    0.532714    0.512235
std      0.297934    0.316769    0.300517    0.289299    0.285194
min      0.003885    0.012490    0.004212    0.004924    0.018044
25%      0.313599    0.257704    0.284493    0.288461    0.253909
50%      0.566300    0.563831    0.520938    0.585214    0.497987
75%      0.823963    0.839938    0.780724    0.772717    0.776071
max      0.999427    0.997553    0.987562    0.992410    0.985378

In [18]:
newdf.dtypes  # returns datatypes of columns

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [19]:
print(newdf.index)
print(newdf.columns)

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
            34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
            51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
            68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
            85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64')
RangeIndex(start=0, stop=5, step=1)

In [20]:
newdf.to_numpy()  # converts to numpy array

array([[0.54323129, 0.72812222, 0.39794183, 0.84802649, 0.53018315],
       [0.91463058, 0.02202868, 0.20504522, 0.64610826, 0.77588568],
       [0.7696002 , 0.80618193, 0.04470907, 0.17180463, 0.56750886],
       [0.16103252, 0.5618427 , 0.6468048 , 0.17619453, 0.91908604],
       [0.21292757, 0.66345385, 0.7507642 , 0.41504057, 0.25434183],
       [0.03795029, 0.36052333, 0.11202594, 0.83967219, 0.70655592],
       [0.29310789, 0.70586884, 0.12043632, 0.28482408, 0.79721025],
       [0.94033565, 0.05885298, 0.98080331, 0.58976686, 0.35234205],
       [0.51891259, 0.66876821, 0.76496644, 0.94870316, 0.30225643],
       [0.5850475 , 0.55539889, 0.14637512, 0.47846654, 0.34239984],
       [0.64879864, 0.75233216, 0.86111904, 0.97775931, 0.8437628 ],
       [0.03084673, 0.45489986, 0.76680306, 0.4855775 , 0.3698929 ],
       [0.31517152, 0.61141627, 0.16700474, 0.05577395, 0.11917262],
       [0.53220919, 0.6362884 , 0.47105279, 0.80728173, 0.07624216],
       [0.56774443, 0.97820114, 0.13636988, 0.0191117 , 0.5983732 ],
       [0.40035853, 0.89861908, 0.03870612, 0.22638058, 0.36590409],
       [0.88386395, 0.05482334, 0.36958403, 0.30358474, 0.60046235],
       [0.07154537, 0.36363485, 0.15304856, 0.55314916, 0.36377421],
       [0.64560618, 0.96315258, 0.15125624, 0.29615592, 0.74950739],
       [0.9238617 , 0.85436051, 0.97063882, 0.72109853, 0.36921279],
       [0.82446184, 0.76412155, 0.8782916 , 0.61054815, 0.95086269],
       [0.81956731, 0.59613513, 0.94983747, 0.79029323, 0.43824648],
       [0.74755782, 0.52713436, 0.66092332, 0.87537847, 0.26401893],
       [0.42056323, 0.45778256, 0.92070657, 0.99241023, 0.40611683],
       [0.6195934 , 0.99318246, 0.44117728, 0.92999931, 0.39934837],
       [0.43212416, 0.59808263, 0.55452879, 0.58570545, 0.12432371],
       [0.93930465, 0.06543961, 0.95251402, 0.28967324, 0.19634795],
       [0.336745  , 0.01249039, 0.66041034, 0.19782679, 0.66130971],
       [0.14231868, 0.53258141, 0.29154245, 0.06609822, 0.58024358],
       [0.90330394, 0.50802739, 0.37389424, 0.69530521, 0.79018873],
       [0.83367451, 0.96011383, 0.75489038, 0.4298063 , 0.98423889],
       [0.77170935, 0.80298759, 0.52541773, 0.10054828, 0.46773524],
       [0.69602015, 0.92198342, 0.45444304, 0.87922024, 0.58989547],
       [0.16942699, 0.92598745, 0.61992127, 0.50854588, 0.82761813],
       [0.67714582, 0.25867879, 0.56753898, 0.92621633, 0.95624425],
       [0.32295067, 0.51932468, 0.89911537, 0.01480814, 0.98537838],
       [0.99942669, 0.49210852, 0.87522857, 0.6831025 , 0.67679259],
       [0.60623111, 0.17842484, 0.71429876, 0.52483043, 0.83782294],
       [0.01828333, 0.97650123, 0.93848239, 0.86795026, 0.45923799],
       [0.11259256, 0.0146058 , 0.152545  , 0.60348796, 0.59627441],
       [0.05601044, 0.98931077, 0.83784939, 0.24624748, 0.44638157],
       [0.66427439, 0.28782301, 0.80605596, 0.93649646, 0.31455753],
       [0.16332992, 0.53837865, 0.95903886, 0.35718193, 0.83071936],
       [0.30888102, 0.99755329, 0.81728911, 0.08975835, 0.23484092],
       [0.66958366, 0.13101843, 0.32890513, 0.67769861, 0.31594307],
       [0.37299417, 0.94385597, 0.7722798 , 0.69515153, 0.92600944],
       [0.83444128, 0.84770742, 0.75596364, 0.51553378, 0.62946183],
       [0.49292425, 0.02576688, 0.82850298, 0.58472172, 0.43468701],
       [0.8898432 , 0.92368714, 0.30600987, 0.73117833, 0.13744583],
       [0.73695861, 0.50491611, 0.11121507, 0.06022474, 0.18425932],
       [0.96040276, 0.78195645, 0.14944202, 0.77094044, 0.58808434],
       [0.80003499, 0.03349922, 0.3361898 , 0.80880529, 0.66515728],
       [0.40172531, 0.81271261, 0.38347148, 0.87407601, 0.19474123],
       [0.00388516, 0.94696825, 0.55258133, 0.68058133, 0.13582772],
       [0.42221047, 0.58749905, 0.75048548, 0.25385127, 0.86033502],
       [0.7064131 , 0.80272258, 0.03760686, 0.20062522, 0.09827398],
       [0.17283941, 0.12919594, 0.45403973, 0.86098233, 0.01804389],
       [0.76011154, 0.07477382, 0.36991258, 0.57824914, 0.84112698],
       [0.3162493 , 0.77731049, 0.84266603, 0.10076432, 0.97080879],
       [0.82970778, 0.18611026, 0.98756181, 0.51067692, 0.19887855],
       [0.82633599, 0.22693059, 0.76278313, 0.11974509, 0.30380722],
       [0.43340582, 0.93916358, 0.51190623, 0.21770983, 0.77662535],
       [0.59834628, 0.48921543, 0.16724565, 0.35142237, 0.90364251],
       [0.59876825, 0.11681345, 0.37254598, 0.51647595, 0.1577249 ],
       [0.02678243, 0.5339724 , 0.00421241, 0.75131649, 0.11388796],
       [0.88067053, 0.5804582 , 0.06395261, 0.98417292, 0.17648845],
       [0.96376692, 0.4533568 , 0.39743178, 0.69760206, 0.95600173],
       [0.82379712, 0.89110787, 0.15390693, 0.37732152, 0.22686328],
       [0.16758471, 0.25478022, 0.36030009, 0.79601852, 0.21195517],
       [0.83263001, 0.9872122 , 0.89383412, 0.61386693, 0.76288394],
       [0.85810771, 0.91493871, 0.47018171, 0.92210999, 0.83013871],
       [0.96495481, 0.8437628 , 0.15371356, 0.46323729, 0.60889484],
       [0.34587052, 0.50721387, 0.89669261, 0.74147436, 0.32007226],
       [0.04627276, 0.40438338, 0.56363644, 0.70172613, 0.22121301],
       [0.64234975, 0.44289999, 0.24721148, 0.10615133, 0.56632273],
       [0.15247156, 0.21363206, 0.49419468, 0.71222014, 0.14357755],
       [0.87798374, 0.09407456, 0.02582068, 0.04394221, 0.95241281],
       [0.77071143, 0.57231877, 0.38789891, 0.66898299, 0.72117872],
       [0.84709355, 0.56581833, 0.33530738, 0.00492381, 0.0371169 ],
       [0.32661262, 0.95094279, 0.9080268 , 0.46149804, 0.31314226],
       [0.5648557 , 0.06551198, 0.01526058, 0.73642917, 0.91086433],
       [0.2911821 , 0.9085172 , 0.59814399, 0.1452668 , 0.58456187],
       [0.04283847, 0.76764223, 0.89194395, 0.59493846, 0.84937451],
       [0.01190438, 0.12089203, 0.26334573, 0.94507005, 0.56460878],
       [0.46343404, 0.0490768 , 0.68893668, 0.45637896, 0.25260942],
       [0.72498302, 0.70361142, 0.37868438, 0.68801548, 0.76720853],
       [0.21169036, 0.96332831, 0.00848462, 0.22255093, 0.60046735],
       [0.85217657, 0.33858782, 0.69012609, 0.46501157, 0.17340825],
       [0.44931959, 0.0252129 , 0.59631257, 0.77804617, 0.48401874],
       [0.44042449, 0.83978022, 0.34816022, 0.82411388, 0.42914901],
       [0.20090477, 0.92690198, 0.89599033, 0.92802366, 0.22363467],
       [0.32093289, 0.20151648, 0.66923445, 0.03046767, 0.49036525],
       [0.9247412 , 0.34591204, 0.84664489, 0.39034473, 0.27002372],
       [0.86070934, 0.13745513, 0.9797382 , 0.78371598, 0.1660429 ],
       [0.48682573, 0.84041028, 0.87785567, 0.38582997, 0.95292551],
       [0.35277004, 0.63518523, 0.56385437, 0.66019654, 0.76264591],
       [0.92816417, 0.40303448, 0.51645822, 0.47995487, 0.77799328],
       [0.62600241, 0.43893202, 0.64362422, 0.85255324, 0.04346578],
       [0.56417491, 0.65396034, 0.47105818, 0.07304417, 0.50560925],
       [0.1356166 , 0.11385936, 0.1666963 , 0.62950109, 0.88868406]])

In [21]:
newdf.T  # transpose of the dataframe

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.543231,0.914631,0.769600,0.161033,0.212928,0.037950,0.293108,0.940336,0.518913,0.585048,...,0.200905,0.320933,0.924741,0.860709,0.486826,0.352770,0.928164,0.626002,0.564175,0.135617
1,0.728122,0.022029,0.806182,0.561843,0.663454,0.360523,0.705869,0.058853,0.668768,0.555399,...,0.926902,0.201516,0.345912,0.137455,0.840410,0.635185,0.403034,0.438932,0.653960,0.113859
2,0.397942,0.205045,0.044709,0.646805,0.750764,0.112026,0.120436,0.980803,0.764966,0.146375,...,0.895990,0.669234,0.846645,0.979738,0.877856,0.563854,0.516458,0.643624,0.471058,0.166696
3,0.848026,0.646108,0.171805,0.176195,0.415041,0.839672,0.284824,0.589767,0.948703,0.478467,...,0.928024,0.030468,0.390345,0.783716,0.385830,0.660197,0.479955,0.852553,0.073044,0.629501
4,0.530183,0.775886,0.567509,0.919086,0.254342,0.706556,0.797210,0.352342,0.302256,0.342400,...,0.223635,0.490365,0.270024,0.166043,0.952926,0.762646,0.777993,0.043466,0.505609,0.888684

In [22]:
newdf.head()

          0         1         2         3         4
0  0.543231  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886
2  0.769600  0.806182  0.044709  0.171805  0.567509
3  0.161033  0.561843  0.646805  0.176195  0.919086
4  0.212928  0.663454  0.750764  0.415041  0.254342

In [23]:
newdf.sort_index(axis=0,ascending=False) # rows get reversed
newdf.sort_index(axis=1,ascending=False) # columns get reversed

           4         3         2         1         0
0   0.530183  0.848026  0.397942  0.728122  0.543231
1   0.775886  0.646108  0.205045  0.022029  0.914631
2   0.567509  0.171805  0.044709  0.806182  0.769600
3   0.919086  0.176195  0.646805  0.561843  0.161033
4   0.254342  0.415041  0.750764  0.663454  0.212928
..       ...       ...       ...       ...       ...
95  0.762646  0.660197  0.563854  0.635185  0.352770
96  0.777993  0.479955  0.516458  0.403034  0.928164
97  0.043466  0.852553  0.643624  0.438932  0.626002
98  0.505609  0.073044  0.471058  0.653960  0.564175
99  0.888684  0.629501  0.166696  0.113859  0.135617

[100 rows x 5 columns]

In [24]:
newdf.head()

          0         1         2         3         4
0  0.543231  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886
2  0.769600  0.806182  0.044709  0.171805  0.567509
3  0.161033  0.561843  0.646805  0.176195  0.919086
4  0.212928  0.663454  0.750764  0.415041  0.254342

In [25]:
newdf[0].head()

0    0.543231
1    0.914631
2    0.769600
3    0.161033
4    0.212928
Name: 0, dtype: float64

In [26]:
print(type(newdf[0]))
print("DataFrame are combinations of series")

<class 'pandas.core.series.Series'>
DataFrame are combinations of series

In [27]:
newdf2=newdf

"""
- here newdf2 is similar to a pointer to newdf, so any changes done in any 1 object 
  will get reflected on both objects since they all point to the same.
- To make a copy of an object, we have to use .copy().
"""

'\n- here newdf2 is similar to a pointer to newdf, so any changes done in any 1 object \n  will get reflected on both objects since they all point to the same.\n- To make a copy of an object, we have to use .copy().\n'

In [28]:
newdf2=newdf.copy()
newdf2.iloc[0,0]=69
print(newdf2.head(2))
print(newdf.head(2))

           0         1         2         3         4
0  69.000000  0.728122  0.397942  0.848026  0.530183
1   0.914631  0.022029  0.205045  0.646108  0.775886
          0         1         2         3         4
0  0.543231  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886

In [29]:
newdf.iloc[0,0]=0.3256
newdf.columns=list("ABCDE")
newdf.head(2)

          A         B         C         D         E
0  0.325600  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886

In [30]:
newdf.drop('A',axis=1)  # dropping rows (axis=0) and columns (axis=1)
newdf.head()

          A         B         C         D         E
0  0.325600  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886
2  0.769600  0.806182  0.044709  0.171805  0.567509
3  0.161033  0.561843  0.646805  0.176195  0.919086
4  0.212928  0.663454  0.750764  0.415041  0.254342

In [31]:
newdf.iloc[:,:]              # full table
newdf.iloc[:,[0,1,2]]        # Full rows
newdf.iloc[[0,1],[0,1,2]]    # printing particular rows and columns

          A         B         C
0  0.325600  0.728122  0.397942
1  0.914631  0.022029  0.205045

In [32]:
newdf.loc[(newdf['A']>0.5) & (newdf['B']<0.8)].head(3) # filtering results

          A         B         C         D         E
1  0.914631  0.022029  0.205045  0.646108  0.775886
7  0.940336  0.058853  0.980803  0.589767  0.352342
8  0.518913  0.668768  0.764966  0.948703  0.302256

In [33]:
# inplace = True means the result will get reflected in the objects
# newdf.drop([0,1,2],axis=0,inplace=True)  # deleting 0,1,2 rows
newdf.head(2)

          A         B         C         D         E
0  0.325600  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886

In [34]:
newdf.reset_index(drop=True,inplace=True)
# when we reset index, the old index gets stored into a column namely 'index'. 
# inorder to ignore than inde, we use drop=True
newdf.head(2)

          A         B         C         D         E
0  0.325600  0.728122  0.397942  0.848026  0.530183
1  0.914631  0.022029  0.205045  0.646108  0.775886

In [35]:
newdf.loc[:,['E']]=None         # sets all values at column as none
newdf['E'].isnull().head(3)     # checks is values are null at column 'B'

0    True
1    True
2    True
Name: E, dtype: bool

In [36]:
newdf.dropna(axis=1,how="any",inplace=True)  # removes all null values
newdf.head()

          A         B         C         D
0  0.325600  0.728122  0.397942  0.848026
1  0.914631  0.022029  0.205045  0.646108
2  0.769600  0.806182  0.044709  0.171805
3  0.161033  0.561843  0.646805  0.176195
4  0.212928  0.663454  0.750764  0.415041

In [37]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman','Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip',np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT,pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Alfred        NaN        NaT

In [38]:
df.drop_duplicates(keep="last",inplace=True)  # removes duplicate rows
df

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Alfred        NaN        NaT

In [39]:
df['toy'].value_counts(dropna=False)  # dropna= False means count null values also

Batmobile    1
Bullwhip     1
NaN          1
Name: toy, dtype: int64

In [40]:
df.notnull()

   name    toy   born
1  True   True   True
2  True   True  False
3  True  False  False

In [43]:
ex=pd.read_excel("school.xlsx",sheet_name="Sheet1")
ex

    Name  Grade  Marks
0   Alex     10     56
1   John     11     98
2    Sam     12     46
3  Smith     11     53

In [47]:
ex.iloc[2,2]=75
ex

    Name  Grade  Marks
0   Alex     10     56
1   John     11     85
2    Sam     12     75
3  Smith     11     53